package day06;

public class ScoreEx1 {

	public static void main(String[] args) {
		/*
		 *  다음 기능을 가진 성적 관리 프로그램 작성
		 *  - 1반의 성적을 관리
		 *  - 최대 30명
		 *  - 성적은 번호순으로 관리
		 *  - 성적은 국어, 영어, 수학
		 *  메뉴
		 *  1. 성적수정
		 *  2. 성적조회
		 *  3. 프로그램 종료
		 *  메뉴선택
		 *  
		 *  - 성적수정을 선택한 경우
		 *  1. 국어
		 *  2. 영어
		 *  3. 수학
		 *  과목 선택 : 
		 *  
		 *  학생선택 : 번호를 선택
		 *  성적 입력 : 
		 *  
		 *  - 성적조회를 선택한 경우
		 *  1. 과목별 조회
		 *  2. 학생별 조회
		 *  선택 : 
		 *  --과목별 조회--
		 *  1. 국어
		 *  2. 영어
		 *  3. 수학
		 *  과목 선택 : 
		 *  1번 : 0점
		 *  2번 : 0점 ...
		 *  30번 : 0점
		 *  
		 *   --학생별 조회--
		 *   학생선택 : 1
		 *   국어 : 0점
		 *   영어 : 0점
		 *   수학 : 0점
		 */

	}

}
